---
kind: method
id: M:Autodesk.Revit.DB.ElementParameterFilter.GetRules
source: html/9442366a-20e8-5a36-39dc-79e0d1c98e41.htm
---
# Autodesk.Revit.DB.ElementParameterFilter.GetRules Method

Returns the set of rules contained in this filter.

## Syntax (C#)
```csharp
public IList<FilterRule> GetRules()
```

## Returns
A copy of the set of rules.